"""
Благотворителна кампания
В сладкарница се провежда благотворителна кампания за събиране на средства, 
в която могат да се включат сладкари от цялата страна. Първоначално прочитаме 
от конзолата броя на дните, в които тече кампанията и броя на сладкарите, 
които ще се включат. След това на отделни редове получаваме количеството 
на тортите, гофретите и палачинките, които ще бъдат приготвени от един 
сладкар за един ден. Трябва да се има предвид следния ценоразпис:
•	Торта - 45 лв.
•	Гофрета - 5.80 лв.
•	Палачинка – 3.20 лв.
1/8 от крайната сума ще бъде използвана за покриване на разходите за 
продуктите по време на кампанията. Да се напише програма, която 
изчислява сумата, която е събрана в края на кампанията.

Вход
От конзолата се четат 5 реда:
1.	Броят на дните, в които тече кампанията – цяло число;
2.	Броят на сладкарите – цяло число;
3.	Броят на тортите – цяло число;
4.	Броят на гофретите – цяло число;
5.	Броят на палачинките – цяло число.

Изход
Да се отпечата на конзолата едно число:
•	парите, които са събрани.
"""
campaign_days = int(input())
count_confectioner = int(input())
count_cackes = int(input())
count_waffles = int(input())
count_pancacke = int(input())

cackes = count_cackes * 45
waffles = count_waffles * 5.80
pancackes = count_pancacke * 3.20

total_sum_per_day = (cackes + waffles + pancackes) * count_confectioner
total_campaign_sum = total_sum_per_day * campaign_days
sum_after_expenses = total_campaign_sum - (total_campaign_sum / 8)

print(sum_after_expenses)