"""
Напишете програма, която изчислява каква сума ще получите в края на депозитния период 
при определен лихвен процент. Използвайте следната формула: 
сума = депозирана сума  + срок на депозита * ((депозирана сума * годишен лихвен процент ) / 12)

- Вход
От конзолата се четат 3 реда:
1.	Депозирана сума – реално число;
2.	Срок на депозита(в месеци) – цяло число;
3.	Годишен лихвен процент – реално число;

- Изход
Да се отпечата на конзолата сумата в края на срока.

"""
deposit_sum = float(input())
term_of_deposit = int(input())
annual_interest_rate = float(input())

montly_interest = (deposit_sum * (annual_interest_rate / 100)) / 12
total_sum = deposit_sum + (term_of_deposit * montly_interest)

print(total_sum)
