"""
Аквариум
За рождения си ден Любомир получил аквариум с формата на паралелепипед. 
Трябва да се пресметне колко литра вода ще събира аквариума, ако се знае, 
че определен процент от вместимостта му е заета от пясък, растения, 
нагревател и помпа. Размерите му – дължина, широчина и височина в 
сантиметри ще бъдат въведени от конзолата.
Един литър вода се равнява на един кубичен дециметър/ 1л=1 дм3/. 
Да се напише програма, която изчислява литрите вода, която са необходими
 за напълването на аквариума.

Вход
От конзолата се четат 4 реда:
1.	Дължина в см – цяло число
2.	Широчина в см – цяло число
3.	Височина в см – цяло число
4.	Процент зает обем – реално число

Изход
Да се отпечата на конзолата едно число:
•	литрите вода, които ще  събира аквариума.

"""

length_cm = int(input())
width_cm = int(input())
high_cm = int(input())
percent_per_volume = float(input())

volume = length_cm * width_cm * high_cm
litre = volume * 0.001
percent = percent_per_volume * 0.01
total = litre * (1 - percent)

print(total)