"""
4.	Задължителна литература
За лятната ваканция в спикъка със задължителна литература на Жоро има определен брой книги,
 но Жоро предпочита да играе с приятели навън. Вашата задача е да помогнете на Жоро да изчисли колко 
 часа на ден трябва да отделя, за да прочете необходимата литература, но и да прекарва максимално време навън.

Вход
От конзолата се четат 3 реда:
1.	Брой страници в текущата книга – цяло число;
2.	Страници, които може да прочита за 1 час – цяло число;
3.	Броя на дните, за които трябва да прочете книгата – цяло число;

Изход
Да се отпечата на конзолата броят часове, които Жоро трябва да отделя за четене всеки ден.

"""
page_count = int(input())
pages = int(input())
days = float(input())

time_to_read = page_count / pages
total = time_to_read / days

print(total)