"""
Лодка за риболов

Тони и приятели много обичат да ходят за риба и са толкова 
запалени по риболова, че решават да отидат на риболов с кораб. 
Цената за наема на кораба зависи от сезона и броя рибари:

В зависимост от сезона:
-----------------------
•	Цената за наем на кораба през пролетта е  3000 лв.;
•	Цената за наем на кораба през лятото и есента е  4200 лв.;
•	Цената за наем на кораба през зимата е  2600 лв.

В зависимост от броя на групата има различна отстъпка:
------------------------------------------------------
•	Ако групата е до 6 човека включително  –  отстъпка от 10%;
•	Ако групата е от 7 до 11 човека включително  –  отстъпка от 15%;
•	Ако групата е от 12 нагоре  –  отстъпка от 25%.
Рибарите ползват допълнително 5% отстъпка, ако са четен брой, 
освен ако не е есен - тогава нямат допълнителна отстъпка, 
която се начислява след като се приспадне отстъпката по горните
критерии.

Напишете програма, която да пресмята дали рибарите ще съберат
достатъчно пари. 

Вход
От конзолата се четат три реда:
•	Бюджет на групата – цяло число;
•	Сезон –  текст: "Spring", "Summer", "Autumn" или "Winter";
•	Брой рибари – цяло число.
Изход
На конзолата да се отпечата следното:
•	Ако бюджетът е достатъчен:
"Yes! You have {останалите пари} leva left."
•	Ако бюджетът НЕ Е достатъчен:
"Not enough money! You need {сумата, която не достига} leva."

Сумите трябва да са форматирани с точност до два знака след 
десетичната запетая.

"""

group_budget = int(input())
season = input()
fishermen = int(input())

additional_discount = 1.00
trip_price = 0.00

if season == 'Summer' or season == 'Autumn':
    trip_price = 4200
elif season == 'Spring':
    trip_price = 3000
elif season == 'Winter':
    trip_price = 2600

if fishermen <= 6:
    trip_price *= 0.9
elif fishermen <= 11:
    trip_price *= 0.85
else:
    trip_price *= 0.75

if season != 'Autumn' and fishermen % 2 == 0:
    trip_price *= 0.95

total_sum = abs(group_budget - trip_price)

if group_budget >= trip_price:
    print(f'Yes! You have {total_sum:.2f} leva left.')
else:
    print(f'Not enough money! You need {total_sum:.2f} leva.')
