"""
Нов дом

Марин и Нели си купуват къща недалеч от София. Нели толкова много обича 
цветята, че Ви убеждава да напишете програма, която да изчисли колко  ще 
им струва, за да засадят определен брой цветя и дали наличният бюджет ще 
им е достатъчен. Различните цветя са с различни цени:
------------------------------------------------------------------
цвете	             | Роза	| Далия	| Лале	| Нарцис  | Гладиола |
Цена на брой в лева	 | 5	| 3.80	| 2.80	| 3	      | 2.50     |
------------------------------------------------------------------

Съществуват следните отстъпки:
•	Ако Нели купи повече от 80 Рози - 10% отстъпка от крайната цена;
•	Ако Нели купи повече от 90  Далии - 15% отстъпка от крайната цена;
•	Ако Нели купи повече от 80 Лалета - 15% отстъпка от крайната цена;
•	Ако Нели купи по-малко от 120 Нарциса - цената се оскъпява с 15%;
•	Ако Нели Купи по-малко от 80 Гладиоли - цената се оскъпява с 20%.

От конзолата се четат 3 реда:
•	Вид цветя - текст с възможности "Roses", "Dahlias", "Tulips", "Narcissus" или "Gladiolus";
•	Брой цветя - цяло число;
•	Бюджет - цяло число.

Да се отпечата на конзолата на един ред:
•	Ако бюджетът им е достатъчен - "Hey, you have a great garden with {броя цвета} {вид цветя} and {останалата сума} leva left.";
•	Ако бюджета им е НЕ достатъчен - "Not enough money, you need {нужната сума} leva more.".

Сумата да бъде форматирана до втория знак след десетичната запетая.

"""
flower_type = input()
flower_qty = int(input())
budget = int(input())

flowers = 0

if flower_type == "Roses":
    flowers = flower_qty * 5
elif flower_type == "Dahlias":
    flowers = flower_qty * 3.80
elif flower_type == "Tulips":
    flowers = flower_qty * 2.80
elif flower_type == "Narcissus":
    flowers = flower_qty * 3
elif flower_type == "Gladiolus":
    flowers = flower_qty * 2.50

if flower_type == "Roses" and flower_qty > 80:
    flowers *= 0.20

print(flowers)
