"""
Конвертор за мерни единици

Да се напише програма, която преобразува разстояние между 
следните 3 мерни единици: mm, cm, m. Използвайте съответствията 
от таблицата по-долу:

1 meter(m) = 1000 millimeters(mm)
1 meter(m) = 100 centimeters(cm)

Входните данни се състоят от три реда, въведени от потребителя:
•	Първи ред: число за преобразуване - реално число;
•	Втори ред: входна мерна единица – текст;
•	Трети ред: изходна мерна единица (за резултата) – текст.
На конзолата да се отпечата резултатът от преобразуването на 
мерните единици, форматиран до третия знак след десетичната запетая.
"""

number = float(input())
unit_one = input()
unit_two = input()

mm = 0

if unit_one == 'm':
    mm = number * 1000
elif unit_one == 'cm':
    mm = number * 10
else:
    mm = number

if unit_two == 'm':
    number = mm / 1000
elif unit_two == 'cm':
    number = mm / 10
else:
    number = mm

print (f'{number:.3f}')    