"""
7.	Световен рекорд по плуване
Иван решава да подобри Световния рекорд по плуване на дълги разстояния. 
На конзолата се въвежда рекордът в секунди, който Иван трябва да подобри, 
 разстоянието в метри, което трябва да преплува и времето в секунди, за 
 което плува разстояние от 1 м. Да се напише програма, която изчислява 
 дали се е справил със задачата, като се има предвид, че: съпротивлението 
 на водата го забавя на всеки 15 м. с 12.5 секунди. Когато се изчислява 
 колко пъти Иванчо ще се забави, в резултат на съпротивлението на водата, 
 резултатът трябва да се закръгли надолу до най-близкото цяло число.
Да се изчисли времето в секунди, за което Иванчо ще преплува разстоянието и 
разликата спрямо Световния рекорд. 

Вход
От конзолата се четат 3 реда:
1.	Рекордът в секунди – реално число;
2.	Разстоянието в метри – реално число;
3.	Времето в секунди, за което плува разстояние от 1 м. - реално число.

Изход
Отпечатването на конзолата зависи от резултата:
•	Ако Иван е подобрил Световния рекорд отпечатваме:
o	" Yes, he succeeded! The new world record is {времето на Иван} seconds."
•	Ако НЕ е подобрил рекорда отпечатваме:
o	"No, he failed! He was {недостигащите секунди} seconds slower."
Резултатът трябва да се форматира до втория знак след десетичната запетая.

"""
import math

record_in_seconds = float(input())
distance_in_meters = float(input())
time_in_seconds = float(input())

distance_to_swim = distance_in_meters * time_in_seconds
current_time = (distance_in_meters // 15) * 12.5
total_time = current_time + distance_to_swim

if total_time >= record_in_seconds:
    print(f"No, he failed! He was {total_time - record_in_seconds:.2f} seconds slower.")
else:
    print(f"Yes, he succeeded! The new world record is {total_time:.2f} seconds.")
